## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/64340904/runs/379a4042-84cd-419d-ac38-43392fa45c19).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>


## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_rds_cluster.terrateam will be created
+   resource "aws_rds_cluster" "terrateam" {
+       allocated_storage                     = (known after apply)
+       apply_immediately                     = (known after apply)
+       arn                                   = (known after apply)
+       availability_zones                    = (known after apply)
+       backup_retention_period               = 35
+       ca_certificate_identifier             = (known after apply)
+       ca_certificate_valid_till             = (known after apply)
+       cluster_identifier                    = "terrateam"
+       cluster_identifier_prefix             = (known after apply)
+       cluster_members                       = (known after apply)
+       cluster_resource_id                   = (known after apply)
+       cluster_scalability_type              = (known after apply)
+       copy_tags_to_snapshot                 = false
+       database_insights_mode                = (known after apply)
+       database_name                         = (known after apply)
+       db_cluster_parameter_group_name       = (known after apply)
+       db_subnet_group_name                  = "terrateam"
+       db_system_id                          = (known after apply)
+       delete_automated_backups              = true
+       enable_global_write_forwarding        = false
+       enable_http_endpoint                  = false
+       enable_local_write_forwarding         = false
+       endpoint                              = (known after apply)
+       engine                                = "aurora-mysql"
+       engine_lifecycle_support              = (known after apply)
+       engine_mode                           = "provisioned"
+       engine_version                        = "8.0.mysql_aurora.3.04.1"
+       engine_version_actual                 = (known after apply)
+       hosted_zone_id                        = (known after apply)
+       iam_roles                             = (known after apply)
+       id                                    = (known after apply)
+       kms_key_id                            = (known after apply)
+       master_password                       = (sensitive value)
+       master_password_wo                    = (write-only attribute)
+       master_user_secret                    = (known after apply)
+       master_user_secret_kms_key_id         = (known after apply)
+       master_username                       = (sensitive value)
+       monitoring_interval                   = (known after apply)
+       monitoring_role_arn                   = (known after apply)
+       network_type                          = (known after apply)
+       performance_insights_kms_key_id       = (known after apply)
+       performance_insights_retention_period = (known after apply)
+       port                                  = (known after apply)
+       preferred_backup_window               = (known after apply)
+       preferred_maintenance_window          = (known after apply)
+       reader_endpoint                       = (known after apply)
+       skip_final_snapshot                   = false
+       storage_encrypted                     = true
+       storage_type                          = (known after apply)
+       tags_all                              = (known after apply)
+       vpc_security_group_ids                = [
+           "sg-0b348aa4ec601f99f",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
